# Используем базовый образ Go для сборки приложения
FROM golang:1.24.0 AS builder

# Устанавливаем рабочую директорию
WORKDIR /app

# Копируем файлы go.mod и go.sum и загружаем зависимости
COPY go.mod go.sum ./
RUN go mod download

# Копируем весь исходный код
COPY . .

# Сборка приложения
RUN CGO_ENABLED=0 go build -o delivery main.go

# Используем минимальный образ для запуска собранного приложения
FROM golang:1.23.0

# Устанавливаем рабочую директорию
WORKDIR /app

# Копируем приложение и все исходные файлы
COPY --from=builder /app .

# Устанавливаем переменную окружения для определения, что приложение запущено в контейнере
ENV IN_CONTAINER=true

# По умолчанию запускаем приложение
CMD ["./delivery"]
